[
  {
    "script": "1. **Hook:** Ever feel like diaper changes are a wrestling match?\n2. **Problem/Setup:** With a squirmy baby, it's a challenge keeping them still.\n3. **Solution/Development:** Try the distraction technique! Keep a special toy or a light-up musical gadget nearby, solely for diaper times. This isn't just any toy, but a magical diaper-changing ally. Hold it just out of reach, so your baby focuses on it, turning a wriggle fest into a moment of awe. This simple trick leverages their natural curiosity and focus on novelty, making diaper changes faster and less stressful for both of you.\n4. **Result/Punchline:** Diaper changes transformed from struggle to snuggle moments!\n5. **Call to action:** Give it a go, and see the magic for yourself!\n\n---\n**",
    "metrics": {
      "duration": 50.800000000000004,
      "words": 127,
      "lines": 7
    },
    "timestamp": 1741165413.5722198
  },
  {
    "script": "1. Hook: Tired of the midnight baby wake-up calls?\n2. Problem/Setup: It's challenging when your baby doesn't sleep through the night, leaving both of you exhausted.\n3. Solution/Development: Start with a soothing bedtime routine: a warm bath, gentle massage, soft lullabies, and dim lights. Consistency is key. Make bedtime predictable and comforting. Research shows a consistent bedtime routine improves sleep quality in babies (Mindell, J. A., et al., 2015).\n4. Result/Punchline: Embrace the power of routine to help your baby (and you!) enjoy a full night's sleep.\n5. Call to action: Try it tonight, and sweet dreams!",
    "metrics": {
      "duration": 41.6,
      "words": 104,
      "lines": 5
    },
    "timestamp": 1741175810.4137037
  },
  {
    "script": "1. Hook: Ever wondered why babies love peekaboo?\n2. Problem/Setup: It's not just a game to them, it's a brain booster!\n3. Solution/Development: Peekaboo teaches babies about object permanence, the concept that objects still exist even when they can't be seen. This game stimulates their memory and helps develop their understanding of the world. Plus, when you reappear with a \"peekaboo!\", it lights up their brain's reward center, encouraging social interaction.\n4. Result/Punchline: So, every \"peekaboo\" is not just fun; it's a step towards their cognitive development.\n5. Call to action: Keep the games going, and watch their little minds grow!",
    "metrics": {
      "duration": 43.6,
      "words": 109,
      "lines": 5
    },
    "timestamp": 1741176012.488885
  },
  {
    "script": "1. **Hook:** Ever noticed your baby’s sudden clinginess? It’s not just you.\n2. **Problem/Setup:** Around 8 months, babies can show signs of anxiety when you leave. It’s a phase called separation anxiety.\n3. **Solution/Development:** This is actually a good sign! It means your baby is forming strong attachments. To ease this phase, practice short goodbyes. Leave for a few minutes and gradually increase your time away. Each return reassures your baby that you’ll always come back. Keep your goodbyes consistent and loving but brief.\n4. **Result/Punchline:** Over time, your baby learns you're still there for them, even if they can't see you. This builds trust and security.\n5. **Call to action:** For more baby milestones and how to handle them, hit that subscribe button!\n\n---\n\n**",
    "metrics": {
      "duration": 53.2,
      "words": 133,
      "lines": 7
    },
    "timestamp": 1741176070.6987374
  }
]