[
  {
    "script": "1. **Hook:** \"Ever feel like you're stuck on a fitness plateau?\"\n2. **Problem/Setup:** \"You exercise regularly but those results just aren't showing!\"\n3. **Solution/Development:** \"The secret? Intensity variations! Mixing high-intensity bursts with low-intensity recovery periods not only boosts your metabolism but also skyrockets fat burning. It's called Interval Training, and it's a game-changer. You don't need extra time, just the right strategy.\"\n4. **Result/Punchline:** \"Break that plateau and watch the magic happen. More energy, visible results, and yes, that feeling of unstoppable achievement!\"\n5. **Call to Action:** \"Start today, one burst at a time. You've got this!\"\n\n**",
    "metrics": {
      "duration": 43.6,
      "words": 109,
      "lines": 6
    },
    "timestamp": 1741165736.5610814
  },
  {
    "script": "1. **Hook:** \"Ever feel too busy for a full workout? You're not alone!\"\n2. **Problem/Setup:** \"Mornings can be hectic, making it tough to find time for fitness.\"\n3. **Solution/Development:** \"Introducing the 10-Minute Morning Workout Routine: a quick, energizing start to your day! It combines dynamic stretches, high-energy cardio, and strength-building moves. Perfect for boosting metabolism and improving mood, without eating up your morning!\"\n4. **Result/Punchline:** \"Just 10 minutes to a more energetic, productive day. You've got this!\"\n5. **Call to action:** \"Roll out your mat and let's kickstart your morning!\"\n\n**",
    "metrics": {
      "duration": 39.6,
      "words": 99,
      "lines": 6
    },
    "timestamp": 1741175838.9539595
  },
  {
    "script": "**Script:**\n\n1. **Hook:** Ever feel too tired to even think about working out? 💤\n2. **Problem/Setup:** You know exercise boosts energy, but starting feels impossible when you're drained.\n3. **Solution/Development:** Here's the hack: Start with just 5 minutes. Choose low-impact activities like walking, yoga, or light stretching. The magic? It signals your brain to produce more endorphins, waking up your body naturally.\n4. **Result/Punchline:** Most find they're energized enough to keep going, turning 5 minutes into a full workout!\n5. **Call to action:** Next time you're tired, commit to 5 minutes. You might just surprise yourself!\n\n**",
    "metrics": {
      "duration": 41.2,
      "words": 103,
      "lines": 7
    },
    "timestamp": 1741176056.5285022
  }
]