[
  {
    "script": "Ever notice how talking to AI assistants is like playing a twisted game of Telephone? You ask for the weather, and suddenly, you're getting recipes for lasagna. It's like, \"Hey Siri, am I gonna need an umbrella today?\" and Siri's like, \"Here's a playlist called 'Songs to Cry to'.\" Makes me think, maybe AI stands for \"Absolutely Inept.\" And don't even get me started on autocorrect. It's like my phone's trying to sabotage my love life on purpose!",
    "metrics": {
      "duration": 34.0,
      "words": 85,
      "lines": 1
    },
    "timestamp": 1741085994.8534114
  },
  {
    "script": "Ever tried explaining cloud computing to someone outside tech? It's like, \"Imagine storing your stuff in someone else’s house but you pay rent for it.\" They nod, looking enlightened.\n\nThen they ask, \"So, can I visit my data on weekends?\" \n\nAnd you're like, \"No, Karen, your selfies aren't on a cloud road trip. They’re just chilling on a server farm, probably gossiping about your passwords.\"\n\nIt's moments like these I wish data had visiting hours. And maybe, just maybe, a loyalty program for frequent visitors.\n\n---",
    "metrics": {
      "duration": 36.4,
      "words": 91,
      "lines": 5
    },
    "timestamp": 1741086001.0188296
  },
  {
    "script": "Ever notice how your computer acts like it's in a bad relationship with updates? It's like, \"Oh, you have an important meeting in five minutes? Let me just throw in a quick update for ya.\" And there you are, staring at the screen, whispering sweet nothings, hoping it hurries up. But no, it decides now's the perfect time to reflect on every choice it's ever made, installing update 1 of 237. I guess in tech, \"It's not you, it's me\" translates to, \"Please restart your computer for the changes to take effect.\"",
    "metrics": {
      "duration": 39.2,
      "words": 98,
      "lines": 1
    },
    "timestamp": 1741086046.1277769
  },
  {
    "script": "Ever notice how using your voice assistant feels like trying to order a sandwich at a noisy bar? You're shouting, \"Hey, turn on the lights!\" But it's like, \"Playing 'Fight Nights'.\"\n\nAnd you're there, thinking, \"Close enough,\" in a room lit only by the glow of your dwindling patience.\n\nThen, it gets philosophical, asking, \"Did you mean 'the inner light'?\" Suddenly, you're in a deep chat about life with a gadget that can't even find the switch.\n\nSo, you just give up and clap on the lights old school. Clap on, sanity off.\n\n---",
    "metrics": {
      "duration": 39.2,
      "words": 98,
      "lines": 5
    },
    "timestamp": 1741086068.728494
  },
  {
    "script": "Ever notice how software updates are like gym memberships? You get the notification and think, \"Yeah, it's time to improve!\" \n\nSo, you agree, but then it says, \"This will take some time.\" Suddenly, your device is more committed to change than you are.\n\nYou come back, and it's like, \"Please restart to complete updates.\" That's the tech version of \"Please leave the gym and re-enter for the magic to happen.\"\n\nAnd just when you thought it’s done, \"Installing update 1 of 97\"... Ah, the eternal cycle of hope and despair.\n\n---",
    "metrics": {
      "duration": 38.0,
      "words": 95,
      "lines": 5
    },
    "timestamp": 1741086126.1009645
  },
  {
    "script": "Ever notice how software updates are like gym memberships? You ignore them for months, promising \"I'll start next week.\" Suddenly, your computer's slower than me after Thanksgiving dinner, groaning under the weight of pending updates. You hit \"remind me tomorrow,\" because who starts a diet on a Wednesday, right? Then one day, it forces an update, and you're watching that progress bar like it's the last slice of pizza at a party. And just like gym results, it promises speed and efficiency, but all you notice is a new icon you didn't want.",
    "metrics": {
      "duration": 39.2,
      "words": 98,
      "lines": 1
    },
    "timestamp": 1741086139.7714736
  },
  {
    "script": "Ever notice how updating software is like a box of chocolates? 🍫💻 You never know what you're gonna get. 😂\n\nClick \"update\" at 3 AM, thinking, \"This will be quick!\" 🌙⏰\n\nThen, it's 9 AM, and you're like, \"Did I just time travel, or is my computer staging a coup?\" 🤷‍♂️🖥️\n\nAnd there's always that one update that promises to \"enhance performance,\" but all it does is turn your speedy laptop into a glorified paperweight. 🐢💾\n\nMoral of the story? The only \"safe update\" is the one you put off indefinitely. 😅🔌\n\n---",
    "metrics": {
      "duration": 36.0,
      "words": 90,
      "lines": 6
    },
    "timestamp": 1741086292.8839462
  },
  {
    "script": "Ever notice how AI assistants 🤖 have become the new pets? 🐶\n\nYou spend hours training them 🕓, teaching them tricks like turning on lights 💡 or playing music 🎵.\n\nAnd just when you think they've got it... \"Hey AI, play my favorite song.\" 🎤\n\nThey respond with, \"Adding 10 lbs of spaghetti 🍝 to your shopping list.\" 🤦‍♂️\n\nIt's like teaching a dog to fetch, but instead, it eats your shoes. 🐕😂\n\n---",
    "metrics": {
      "duration": 26.400000000000002,
      "words": 66,
      "lines": 6
    },
    "timestamp": 1741086741.837511
  },
  {
    "script": "\"Ever notice how joining a new online platform feels? 😅 First, you're excited, navigating through the signup like a pro. 💻🚀\n\nThen, it asks for a password. 'No problem,' you think. 🔐💪 But oh, it wants 12 characters, symbols, a haiku, and the blood of a unicorn. 🦄💔\n\nYou finally craft the perfect password... only to forget it the next day. 🤦‍♂️😂\n\nMoral of the story? The 'Forgot Password' link is my best friend. 🤷‍♀️🔗\"\n\n---",
    "metrics": {
      "duration": 28.0,
      "words": 70,
      "lines": 5
    },
    "timestamp": 1741086760.5955176
  },
  {
    "script": "Starting a new coding project like: \"This time, it's gonna be clean and efficient!\" 🧑‍💻✨\n\nTwo weeks later, looking at the code: \"Was I writing software or casting a dark spell?\" 🤦‍♂️🔮\n\nDebugging it like: \"Ah, yes, the classic 'I have no idea why this works, but it does.'\" 🤷‍♀️💻\n\nMoral of the story: The real magic spell was the friends (and bugs) we made along the way. 😂👾\n\n---",
    "metrics": {
      "duration": 26.400000000000002,
      "words": 66,
      "lines": 5
    },
    "timestamp": 1741087452.4054618
  },
  {
    "script": "Ever notice how your phone's battery life is like a trusty friend? 📱👫 Starts out full of energy, ready to tackle the world with you. \n\nCut to 3 PM, suddenly it's at 20%, having a mid-life crisis, questioning its purpose. 🕒😂 \n\nBy 6 PM, it's clinging to life at 5%, making you promise to live your dreams for it. 🌅🔋 \n\nHit like for more tech humor! \n\n---",
    "metrics": {
      "duration": 26.8,
      "words": 67,
      "lines": 5
    },
    "timestamp": 1741087923.9997132
  },
  {
    "script": "Ever try explaining cloud computing to your grandparents? 🌐😅  \n\"It's like storing your stuff somewhere else,\" I say. 🤷‍♂️💻  \nThey nod, then ask, \"So, whose computer is it on?\" 🤔💾  \nI tell them, \"It's on everyone's... and no one's.\" 🌍🖥️  \nThey pause, squint, and go, \"So, it's magic?\" 🧙‍♂️✨  \n\"Exactly, it's magic,\" I sigh, accepting defeat. 🤦‍♂️😂  \nHit like for more tech wizardry! 🔮👍  \n\n---",
    "metrics": {
      "duration": 25.200000000000003,
      "words": 63,
      "lines": 8
    },
    "timestamp": 1741087937.9640753
  },
  {
    "script": "Script:\n\nEver notice how your phone's battery life 📱💀 is like a surprise party? Starts full of energy 🎉, but by noon, it's like, \"Surprise! I'm at 20% 😱.\"\n\nAnd you're like, \"But I only checked the time and cried at a meme 😂🤷‍♀️.\"\n\nMakes you wonder if the battery is just in it for the drama 🎭 or if it's secretly training for an endurance sport 🏋️‍♂️ where the goal is to see how fast it can quit.\n\nHit like for more tech humor! 👍💬\n\n---",
    "metrics": {
      "duration": 33.6,
      "words": 84,
      "lines": 6
    },
    "timestamp": 1741088046.7953148
  },
  {
    "script": "A QA engineer walks into a bar... 🍺\nOrders a beer, orders 0 beers, orders 999999 beers...\nThen a customer asks where the bathroom is and the bar bursts into flames! 🔥\nFollow for more tech humor! 🚀",
    "metrics": {
      "duration": 14.0,
      "words": 35,
      "lines": 4
    },
    "timestamp": 1741160337.9166555
  },
  {
    "script": "Documentation is like romance novels... 📝\nWhen it's good, it's very good.\nWhen it's bad, it's better than nothing! 😅\nFollow for more tech humor! 🚀",
    "metrics": {
      "duration": 10.8,
      "words": 27,
      "lines": 4
    },
    "timestamp": 1741165670.2234664
  },
  {
    "script": "Why do programmers always mix up Halloween and Christmas? 🎃🎄  \nBecause Oct 31 == Dec 25! 🤓  \n(It’s a binary joke… you either get it or you don’t.) 😏  \nFollow for more tech humor! 🚀",
    "metrics": {
      "duration": 12.8,
      "words": 32,
      "lines": 4
    },
    "timestamp": 1741168081.781441
  },
  {
    "script": "Why do programmers always mix up Halloween and Christmas? 🎃🎄  \nBecause Oct 31 == Dec 25! 🤓  \n(It’s a binary joke… you’ll get it eventually.)  \nFollow for more tech humor! 🚀",
    "metrics": {
      "duration": 11.600000000000001,
      "words": 29,
      "lines": 4
    },
    "timestamp": 1741168367.3049698
  },
  {
    "script": "Why do programmers always mix up Halloween and Christmas? 🎃🎄  \nBecause Oct 31 == Dec 25!  \n(If you don’t get it, you’re not a real dev. 😏)  \n\nFollow for more tech humor!",
    "metrics": {
      "duration": 12.4,
      "words": 31,
      "lines": 4
    },
    "timestamp": 1741170815.9518616
  },
  {
    "script": "Why do programmers always mix up Halloween and Christmas? 🎃🎄  \nBecause Oct 31 == Dec 25! 🤓  \n(If you get it, you’re a true dev. If not, go learn hex. 😂)  \n\nFollow for more tech humor! 🚀",
    "metrics": {
      "duration": 13.200000000000001,
      "words": 33,
      "lines": 4
    },
    "timestamp": 1741170941.9329793
  },
  {
    "script": "Why do programmers always mix up Halloween and Christmas? 🎃🎄  \nBecause Oct 31 == Dec 25! 🤓  \n(Yes, it’s a base-8 joke. Don’t @ me.)  \n\nFollow for more tech humor! 🚀",
    "metrics": {
      "duration": 11.600000000000001,
      "words": 29,
      "lines": 4
    },
    "timestamp": 1741174039.1034873
  }
]